
'-------------------------Скрипт очистки папки с проектами Maestro от файлов ADB и DBL---------------------------
'Версия 1.0
'Версия 2.0		Поиск и удаление файлов adb и dbl во всей иерархии подкаталогов 
'Версия 2.1		Исправлена ошибка в процедуре CheckSubFolders 

'================================================================================================================

'!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!
'!!! ПРОВЕРЬТЕ ПАРАМЕТРЫ !!!!!!!!!!!!!!!!!!!!!!!!!!!ПРОВЕРЬТЕ ПАРАМЕТРЫ!!!!!!!!!!!!!!!!!!!!ПРОВЕРЬТЕ ПАРАМЕТРЫ!!!
'!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!


path_Maestro_Project = "C:\Program Files (x86)\Scm Group\Maestro\Projects"	'Каталог с проектами Maestro

filter1="_adb."									'Файлы с какими символами удаляем
filter2="_dbl."									'Файлы с какими символами удаляем	


'!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!
'!!! ПРОВЕРЬТЕ ПАРАМЕТРЫ !!!!!!!!!!!!!!!!!!!!!!!!!!!ПРОВЕРЬТЕ ПАРАМЕТРЫ!!!!!!!!!!!!!!!!!!!!ПРОВЕРЬТЕ ПАРАМЕТРЫ!!!
'!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!




















































'===========================================================================
Function check_and_delete (FilePath)						'Функция проверки соответствий файла фильтрам и удаления файла		
	if InStr(1,FilePath,filter1,1) or InStr(1,FilePath,filter2,1) Then	'Проверка соответствия фильтру для удаления
		Set File = FSO.GetFile(FilePath)
		File.Delete							'Удаление файла
	end if
End Function


Set FSO = CreateObject("Scripting.FileSystemObject")
if FSO.FolderExists(path_Maestro_Project) = FALSE then				'Проверка существования каталога с проектами Maestro
	MsgBox "Не существует каталог:" & vbNewLine & _
		path_Maestro_Project & vbNewLine & _
		vbNewLine & "Проверьте параметр:" & vbNewLine & _
		"path_Maestro_Project",_
		48,"Очистка папки с проектами Maestro от файлов adb и dbl"
	WScript.Quit								'Завершение скрипта и вывод сообщения, если каталог не существует
End if

CheckSubFolders FSO.GetFolder(path_Maestro_Project)

Sub CheckSubFolders(Folder)										'Процедура обработки каталога
	For Each subfolder In Folder.SubFolders						'Цикл обработки подкаталогов
		'WScript.Echo subfolder
		For Each FilePath In subfolder.Files						'Цикл обработки файлов в каталоге
			check_and_delete(FilePath)							'Обращение к функции проверки и удаления файла
		Next

		CheckSubFolders subfolder								'Вызов процедуры обработки подкаталога текущего каталога

	Next
End Sub